OdDAI.OdUnitConverter.clearUnits
\details
Removes all convertible units.

OdDAI.OdUnitConverter.getConversionUnitName(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdAnsiString*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdAnsiString*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Gets name and prefix of conversion type.
\param unitType [in] A string that contains the type of the unit to be returned.
\param unitName [out] A unit name.
\param unitPrefix [out] A unit prefix name. If no prefix then the value is empty.
\returns True if the attributes are retrieved successfully, false otherwise.

OdDAI.OdUnitConverter.appendUnit(OdDAIObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Appends a new convertible unit.
\param unitId [in] An identifier of the corresponding ConversionBasedUnit object.

OdDAI.OdUnitConverter.appendUnit(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdDAIObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Appends a new convertible unit.
\param unitType [in] A string that contains the type of the convertible unit.
\param unitId   [in] An identifier of the corresponding ConversionBasedUnit object.

OdDAI.OdUnitConverter.convertToSIUnit(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double)
\details
Performs an attempt to convert a specified unit to the SI unit.
\param unitType [in] A string that contains the type of the unit to be converted.
\param val      [in] A unit value.
\returns A double value that contains the converted value of the specified unit type.

OdDAI.OdUnitConverter.Dispose
\details
Destructor.

OdDAI.OdUnitConverter
\details
A class that implements an interface for conversion of different units to the SI units.